W6D3/w6d3/first_routes/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    # render plain: "I'm in the index action!"
    users = User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "\"Jason Vorhees\""], ["email", "\"die@gmail.com\""], ["created_at", "2019-11-20 23:40:04.045212"], ["updated_at", "2019-11-20 23:40:04.045212"]]
---
  def create
  user = User.new(params.require(:user).permit(:name, :email))
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    id = params[:id]
    render json: User.find(id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Metaworldpeace"], ["email", "ronnyron@gmail.com"], ["updated_at", "2019-11-21 00:12:05.060809"], ["id", 3]]
---
  def update
    id = params[:id]
    user = User.find(id)
    user.update(params.require(:user).permit(:name, :email))

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
  def destroy
    id = params[:id]
    user = User.find(id)
    user.destroy