W6D4/w6d3and4/first_routes/app/controllers/artwork_shares_controller.rb

  def destroy
    artshare = ArtworkShare.find_by(id: params[:id])
    if artshare.nil?
      render json: "Like does not exist", status: :forbidden
    else
      artshare.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 5]]

  def index
    artshare = ArtworkShare.all
---
SELECT "artwork_shares".* FROM "artwork_shares"