W6D4/w6d3and4/first_routes/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
---
  def index
    user = User.find_by(id: params[:user_id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def show
    artwork = Artwork.find(params[:id])

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "It Follows"], ["image_url", "movie.com"], ["artist_id", 25], ["created_at", "2019-11-21 19:06:55.623082"], ["updated_at", "2019-11-21 19:06:55.623082"]]
---
  def create
    artwork = Artwork.new(artwork_params)
    if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 12]]
---
  def destroy
    artwork = Artwork.find_by(id: params[:id])
    if artwork.nil?
      render json: 'Artwork not found', status: :forbidden
    else
      artwork.destroy

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "film.com"], ["updated_at", "2019-11-21 19:11:08.216108"], ["id", 13]]
---
  def update
    artwork = Artwork.find(params[:id])
    if artwork.update(artwork_params)