W6D4/w6d3and4/first_routes/app/controllers/comments_controller.rb

  def index
    if params[:user_id].nil?
      if params[:artwork_id].nil?
        comments = Comment.all
        render json: comments
      else
        artwork = Artwork.find_by(id: params[:artwork_id])
        render json: artwork.comments
      end
    else
      user = User.find_by(id: params[:user_id])
---
SELECT "comments".* FROM "comments"
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]