W6D4/w6d3and4/first_routes/app/controllers/likes_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 54], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
---
  def index
    if params[:comment_id].nil?
      if params[:artwork_id].nil?
        likes = Like.all
        render json: likes
      else
        artwork = Artwork.find_by(id: params[:artwork_id])
        render json: artwork.likes
      end
    else
      comment = Comment.find_by(id: params[:comment_id])