W6D4/w6d3and4/first_routes/app/controllers/users_controller.rb

  def index
    # render plain: "I'm in the index action!"
    if params[:username]
      user = User.find_by(username: params[:username])
      render json: user
    else
      users = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Freddy_K"], ["LIMIT", 1]]
SELECT "users".* FROM "users"

  def create
  user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "\"Jason Vorhees\""], ["email", "\"die@gmail.com\""], ["created_at", "2019-11-20 23:40:04.045212"], ["updated_at", "2019-11-20 23:40:04.045212"]]

  def show
    id = params[:id]
    render json: User.find(id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    user = User.find(params[:id])
    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Metaworldpeace"], ["email", "ronnyron@gmail.com"], ["updated_at", "2019-11-21 00:12:05.060809"], ["id", 3]]

  def destroy
    user = User.find(params[:id])
    user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]